NotStockEcu/uaefi_notstock/dash/notstock-dash-7inch/sdkconfig.defaults
# ---- target ----------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# ---- flash / PSRAM (ESP32-S3-WROOM-1-N8R8 or N16R8) -------------------------
# ESP32-S3-Touch-LCD-7 carries an N8R8 module (8 MB flash, 8 MB PSRAM)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# SINGLE_APP_LARGE caps the app at 1.5 MB and the baked dial artwork alone is
# over 1 MB, so the app gets almost the whole 8 MB instead.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# ---- performance -----------------------------------------------------------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# RGB panel restarts its DMA in vsync, kills the sideways drift
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y

# ---- console on UART0 -----------------------------------------------------
# The 7 inch has a CH343 USB-UART bridge on GPIO43/44 behind the "UART"
# Type-C port. That is the port to flash and monitor through. The other
# Type-C (USB OTG, GPIO19/20) dies at boot because EXIO5 hands those pins to
# the CAN transceiver, so the console must not live on USB Serial/JTAG.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# IDF defaults to a secondary console on USB Serial/JTAG, which sits on the
# same GPIO19/20 as CAN. Off.
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# ---- radios off: nothing needs them and they steal SPI bandwidth -----------
CONFIG_ESP_WIFI_ENABLED=n

# ---- LVGL (configured through Kconfig, no lv_conf.h) -----------------------
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_16_SWAP=n
CONFIG_LV_MEM_SIZE_KILOBYTES=64
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_DISP_DEF_REFR_PERIOD=20
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_USE_MEM_MONITOR=n
CONFIG_LV_USE_METER=y
CONFIG_LV_USE_CHART=y
CONFIG_LV_USE_IMG=y
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_FLEX=y
